{
  "requirements": [
    "psycopg2"
  ], 
  "description": [
    "Add or remove PostgreSQL users (roles) from a remote host and, optionally, grant the users access to an existing database or tables.", 
    "The fundamental function of the module is to create, or delete, roles from a PostgreSQL cluster. Privilege assignment, or removal, is an optional step, which works on one database at a time. This allows for the module to be called several times in the same module to modify the permissions on different databases, or to grant permissions to already existing users.", 
    "A user cannot be removed untill all the privileges have been stripped from the user. In such situation, if the module tries to remove the user it will fail. To avoid this from happening the fail_on_user option signals the module to try to remove the user, but if not possible keep going; the module will report if changes happened and separately if the user was removed or not."
  ], 
  "author": "Lorin Hochstein", 
  "notes": [
    "The default authentication assumes that you are either logging in as or sudo'ing to the postgres account on the host.", 
    "This module uses psycopg2, a Python PostgreSQL database adapter. You must ensure that psycopg2 is installed on the host before using this module. If the remote host is the PostgreSQL server (which is the default case), then PostgreSQL must also be installed on the remote host. For Ubuntu-based systems, install the postgresql, libpq-dev, and python-psycopg2 packages on the remote host before using this module."
  ], 
  "docuri": "postgresql-user", 
  "module": "postgresql_user", 
  "filename": "library/postgresql_user", 
  "examples": [
    {
      "code": "postgresql_user db=acme user=django password=ceec4eif7ya priv=CONNECT/products:ALL", 
      "description": "Create django user and grant access to database and products table"
    }, 
    {
      "code": "postgresql_user db=acme user=test priv=ALL/products:ALL state=absent fail_on_user=no", 
      "description": "Remove test user privileges from acme"
    }, 
    {
      "code": "postgresql_user db=test user=test priv=ALL state=absent", 
      "description": "Remove test user from test database and the cluster"
    }, 
    {
      "code": "INSERT,UPDATE/table:SELECT/anothertable:ALL", 
      "description": "Example privileges string format"
    }
  ], 
  "version_added": "0.6", 
  "short_description": "Adds or removes a users (roles) from a PostgreSQL database.", 
  "now_date": "2012-10-09", 
  "options": {
    "name": {
      "default": null, 
      "required": true, 
      "description": [
        "name of the user (role) to add or remove"
      ]
    }, 
    "login_user": {
      "default": "postgres", 
      "required": false, 
      "description": [
        "User (role) used to authenticate with PostgreSQL"
      ]
    }, 
    "login_host": {
      "default": "localhost", 
      "required": false, 
      "description": [
        "Host running PostgreSQL."
      ]
    }, 
    "db": {
      "default": null, 
      "required": false, 
      "description": [
        "name of database where permissions will be granted"
      ]
    }, 
    "state": {
      "default": "present", 
      "required": false, 
      "description": [
        "The database state"
      ], 
      "choices": [
        "present", 
        "absent"
      ]
    }, 
    "login_password": {
      "default": null, 
      "required": false, 
      "description": [
        "Password used to authenticate with PostgreSQL"
      ]
    }, 
    "password": {
      "default": null, 
      "required": true, 
      "description": [
        "set the user's password"
      ]
    }, 
    "fail_on_user": {
      "default": true, 
      "required": false, 
      "description": [
        "if yes, fail when user can't be removed. Otherwise just log and continue"
      ], 
      "choices": [
        "yes", 
        "no"
      ]
    }, 
    "priv": {
      "default": null, 
      "required": false, 
      "description": [
        "PostgreSQL privileges string in the format: C(table:priv1,priv2)"
      ]
    }
  }, 
  "ansible_version": "0.8"
}